using System;
using System.Threading.Tasks;

namespace lab01
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Матрица A: ");
            Console.Write("Введите количество строк в матрице: ");
            int rows_array1 = int.Parse(Console.ReadLine());

            Console.Write("Введите количество столбцов в матрице: ");
            int columns_array1 = int.Parse(Console.ReadLine());

            int[,] array1 = new int[,]
            {
                {0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1 }, //1
                {0,0,0,0,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0 }, //2
                {0,1,0,1,1,1,1,1,1,1,1,1,0,0,0,1,1,1,1,1 }, //3
                {0,1,0,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0 },//4
                {0,1,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0 },//5
                {0,1,0,0,1,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0 },//6
                {0,1,0,0,1,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0 },//7
                {0,1,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0 },//8
                {0,1,0,1,1,1,1,1,0,1,1,1,0,0,0,0,0,0,0,0 },//9
                {0,1,0,1,1,1,1,1,1,0,1,1,0,0,0,0,0,0,0,0 },
                {0,1,0,1,1,1,1,1,1,1,0,1,0,0,0,0,0,0,0,0 },
                {0,1,0,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0 },
                {1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,1,1,1,1,1 },
                {1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1 },
                {1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1 },
                {0,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,1,1,1,1},
                {0,1,1,1,1,1,1,1,1,1,1,1,0,0,0,1,0,1,1,1 },
                {0,1,1,1,1,1,1,1,1,1,1,1,0,0,0,1,1,0,1,1 },
                {0,1,1,1,1,1,1,1,1,1,1,1,0,0,0,1,1,1,0,1 },
                {0,1,1,1,1,1,1,1,1,1,1,1,0,0,0,1,1,1,1,0 }
            };

            Matrix.GraphRang(Matrix.SumInRow(Matrix.MatrixAddition(array1, Matrix.MatrixMultiply(array1, array1))));

            /*
            //Обработка исключений
            try
            {
                Matrix.CalculateInverseMatrix(array1);
            }
            //Если матрица 
            catch(DeterminantNullException e)
            {
                Console.WriteLine(e.Message);
            }
            catch(NonSquareMatrixException e)
            {
                Console.WriteLine(e.ToString());
            }
            */
            Console.ReadKey();
        }
    }
}
